// Вывести на экран четные числа от 1 до N

int n,i;
i=2;
n=Convert.ToInt32(Console.ReadLine());
while (i<=n)
{
    System.Console.WriteLine(i);
    i=i+2;
}