// Написать программу вычисления значения функции y = sin(a)
int a;
//double y;
a=Convert.ToInt32(Console.ReadLine());
//y=Math.Sin(a);
//System.Console.WriteLine($"sin(a)={y}");
System.Console.WriteLine($"sin(a)={Math.Sin(a)}");